In [2]:
import pandas as pd
import numpy as np
df=pd.read_csv("messages.csv")

In [3]:
df.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [4]:
df.drop(columns=["msg"],inplace=True)

In [5]:
df.head()

                  date
0  2013-12-15 00:50:00
1  2014-04-29 23:40:00
2  2012-12-30 00:21:00
3  2014-11-28 00:31:00
4  2013-10-26 23:11:00

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [7]:
df["date"]=pd.to_datetime(df["date"])

In [8]:
df.head()

                 date
0 2013-12-15 00:50:00
1 2014-04-29 23:40:00
2 2012-12-30 00:21:00
3 2014-11-28 00:31:00
4 2013-10-26 23:11:00

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [10]:
df.head()

                 date
0 2013-12-15 00:50:00
1 2014-04-29 23:40:00
2 2012-12-30 00:21:00
3 2014-11-28 00:31:00
4 2013-10-26 23:11:00

In [13]:
df["hour"]=df["date"].dt.hour
df["min"]=df["date"].dt.minute
df["sec"]=df["date"].dt.second

In [14]:
df.head()

                 date  hour  min  sec
0 2013-12-15 00:50:00     0   50    0
1 2014-04-29 23:40:00    23   40    0
2 2012-12-30 00:21:00     0   21    0
3 2014-11-28 00:31:00     0   31    0
4 2013-10-26 23:11:00    23   11    0

In [15]:
# Extrcat time part
df["time only"]=df["date"].dt.time

In [16]:
df.head()

                 date  hour  min  sec time only
0 2013-12-15 00:50:00     0   50    0  00:50:00
1 2014-04-29 23:40:00    23   40    0  23:40:00
2 2012-12-30 00:21:00     0   21    0  00:21:00
3 2014-11-28 00:31:00     0   31    0  00:31:00
4 2013-10-26 23:11:00    23   11    0  23:11:00

In [17]:
import datetime
today=datetime.datetime.today()

In [18]:
today

datetime.datetime(2024, 6, 26, 10, 16, 26, 518261)

In [19]:
# Time difference
today-df["date"]

0     3846 days 09:26:26.518261
1     3710 days 10:36:26.518261
2     4196 days 09:55:26.518261
3     3498 days 09:45:26.518261
4     3895 days 11:05:26.518261
                 ...
995   4485 days 09:26:26.518261
996   3806 days 11:02:26.518261
997   4271 days 10:39:26.518261
998   4387 days 10:42:26.518261
999   3659 days 10:51:26.518261
Name: date, Length: 1000, dtype: timedelta64[ns]

In [20]:
(today-df["date"])/np.timedelta64(1,"s") # difference in seconds

0      3.323284e+08
1      3.205822e+08
2      3.625701e+08
3      3.022623e+08
4      3.365679e+08
           ...
995    3.875380e+08
996    3.288781e+08
997    3.690528e+08
998    3.790753e+08
999    3.161767e+08
Name: date, Length: 1000, dtype: float64

In [21]:
(today-df["date"])/np.timedelta64(1,"m") # difference in minutes

0      5.538806e+06
1      5.343036e+06
2      6.042835e+06
3      5.037705e+06
4      5.609465e+06
           ...
995    6.458966e+06
996    5.481302e+06
997    6.150879e+06
998    6.317922e+06
999    5.269611e+06
Name: date, Length: 1000, dtype: float64

In [22]:
(today-df["date"])/np.timedelta64(1,"h") # difference in hour

0       92313.440700
1       89050.607366
2      100713.924033
3       83961.757366
4       93491.090700
           ...
995    107649.440700
996     91355.040700
997    102514.657366
998    105298.707366
999     87826.857366
Name: date, Length: 1000, dtype: float64